In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([[2.4, np.nan], [6.3, -5.4], [np.nan, np.nan], [0.75, -1.3]], index= ["a", "b", "c", "d"], columns= ["bir", "iki"])
df

# df değişkeninde içinde eksik verilerinde bulunduğu bir dataframe oluşturduk. 
# satır ve sütunun isimlerini belirledik.

    bir  iki
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

# Sütunlardaki verilerin toplamını sum() metoduyla bulabiliyoruz.

bir    9.45
iki   -6.70
dtype: float64

In [5]:
df.sum(axis= 1)

# Satırların toplamı için axis= 1 parametresi girebiliriz.

a    2.40
b    0.90
c    0.00
d   -0.55
dtype: float64

In [6]:
df.mean(axis= 1)

# Satırların ortalaması için axis= 1 parametresini girebiliriz.

a    2.400
b    0.450
c      NaN
d   -0.275
dtype: float64

In [7]:
df.mean()

# Girmezsek varsayılan olarak sütunları esas alır.

bir    3.15
iki   -3.35
dtype: float64

In [8]:
df.mean(axis= 1, skipna= False)

# skipna= False parametresi girersek satırda eksik veri varsa ortalamasını NaN olarak verir.

a      NaN
b    0.450
c      NaN
d   -0.275
dtype: float64

In [10]:
df

    bir  iki
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [9]:
df.idxmax()

# idxmax() methoduyla iki sütun için maximum veriye sahip satırların index değerleri yazdırılır.

bir    b
iki    d
dtype: object

In [11]:
df.idxmin()

# idxmax() methoduyla iki sütun için minimum veriye sahip satırların index değerleri yazdırılır.

bir    d
iki    b
dtype: object

In [13]:
df

    bir  iki
a  2.40  NaN
b  6.30 -5.4
c   NaN  NaN
d  0.75 -1.3

In [12]:
df.cumsum()

# Kümilatif toplam yani sırayla toplarak bir sonraki satıra geçen toplama biçimini kullanmak 
# içinde cumsum() methodunu kullanıyoruz.

    bir  iki
a  2.40  NaN
b  8.70 -5.4
c   NaN  NaN
d  9.45 -6.7

In [14]:
df.describe()

# veri setinin özet bilgilerini almak içinde describe() methodunu kullanıyoruz.

         bir       iki
count  3.000  2.000000
mean   3.150 -3.350000
std    2.850  2.899138
min    0.750 -5.400000
25%    1.575 -4.375000
50%    2.400 -3.350000
75%    4.350 -2.325000
max    6.300 -1.300000

In [17]:
vg = pd.read_csv("vgsales.csv")
vg

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [20]:
vg.head()

# İlk 5 satırı yazdırdık.

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37

In [21]:
vg["NA_Sales"].corr(vg["EU_Sales"])

# corr() metoduyla iki sütunun corrolasyon değerine bakıyoruz.
# 1'e ne kadar yakınsa aralarındaki ilişki mükemmele o kadar yakın oluyor.

0.767726748370264

In [23]:
vg.corr()

# Bütün sayısal verilerin birbiriyle ikili corrolasyon değerlerini görebiliyoruz.

C:\Users\Fallrytme\AppData\Local\Temp\ipykernel_6364\169480442.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  vg.corr()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,1.000000,0.178814,-0.401362,-0.379123,-0.267785,-0.332986,-0.427407
Year,0.178814,1.000000,-0.091402,0.006014,-0.169316,0.041058,-0.074735
NA_Sales,-0.401362,-0.091402,1.000000,0.767727,0.449787,0.634737,0.941047
EU_Sales,-0.379123,0.006014,0.767727,1.000000,0.435584,0.726385,0.902836
JP_Sales,-0.267785,-0.169316,0.449787,0.435584,1.000000,0.290186,0.611816
Other_Sales,-0.332986,0.041058,0.634737,0.726385,0.290186,1.000000,0.748331
Global_Sales,-0.427407,-0.074735,0.941047,0.902836,0.611816,0.748331,1.000000

In [24]:
vg.cov()

# cov() methodu ise iki degiskenin birlikte nasil degistigini gosteren kovaryans degerini verir.

C:\Users\Fallrytme\AppData\Local\Temp\ipykernel_6364\2482806049.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  vg.cov()

,Rank,Year,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,2.296186e+07,4995.406080,-1570.701366,-918.073748,-396.877102,-300.915863,-3184.806119
Year,4.995406e+03,33.977021,-0.437728,0.017835,-0.307488,0.045444,-0.682076
NA_Sales,-1.570701e+03,-0.437728,0.666971,0.316850,0.113613,0.097760,1.195097
EU_Sales,-9.180737e+02,0.017835,0.316850,0.255380,0.068082,0.069227,0.709480
JP_Sales,-3.968771e+02,-0.307488,0.113613,0.068082,0.095661,0.016926,0.294256
Other_Sales,-3.009159e+02,0.045444,0.097760,0.069227,0.016926,0.035566,0.219456
Global_Sales,-3.184806e+03,-0.682076,1.195097,0.709480,0.294256,0.219456,2.418112

In [25]:
vg.corrwith(vg.NA_Sales)

# NA_Sales sütununun diğer sütunlar ile ikili corrolasyon değerlerini de bu şekilde görebiliriz.

C:\Users\Fallrytme\AppData\Local\Temp\ipykernel_6364\892342702.py:1: FutureWarning: The default value of numeric_only in DataFrame.corrwith is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  vg.corrwith(vg.NA_Sales)

Rank           -0.401362
Year           -0.091402
NA_Sales        1.000000
EU_Sales        0.767727
JP_Sales        0.449787
Other_Sales     0.634737
Global_Sales    0.941047
dtype: float64

In [26]:
s = pd.Series(["b", "b", "b", "b", "c", "c", "a", "a", "a"])
s

# s değişkeninde Series veri tipi oluşturduk.

0    b
1    b
2    b
3    b
4    c
5    c
6    a
7    a
8    a
dtype: object

In [27]:
s.unique()

# Tekrar eden değerleri göstermez. Sadece bir kere gösterir.

array(['b', 'c', 'a'], dtype=object)

In [28]:
s.value_counts()

# s Series'imizde hangi değerin kaç adet olduğunu sayar.

b    4
a    3
c    2
dtype: int64

In [30]:
x = s.isin(["b", "c"])
x

# Aramak istediğimiz satırları parametre olarak isin() methoduna yazıyoruz.
# O da bize True ve False değerleri geri döndürüyor.
# True değerleri o satırda bulunduğunu False bulunmadığını gösterir.

0     True
1     True
2     True
3     True
4     True
5     True
6    False
7    False
8    False
dtype: bool

In [31]:
s[x]

# Şeklinde filtreleyerekte aradığımız verilerin bulunduğu satırları yazdırabiliriz.

0    b
1    b
2    b
3    b
4    c
5    c
dtype: object